{
  "backend/main.mo": "Motoko canister defining user profiles, persistent Sky World state, and authorized game actions like initialization and profile access.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries for select frontend game and social utility files.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling auth, profile setup, tab navigation, audio unlock, and Sky World initialization.",
  "frontend/src/audio/useAudioManager.ts": "React hook managing audio context initialization, playback, volume, and mute state.",
  "frontend/src/components/AudioControls.tsx": "UI component providing a popover with volume slider and mute toggle tied to the audio manager.",
  "frontend/src/components/HudOverlay.tsx": "HUD overlay showing timer, collections, pause control, and Qudo boost indicator during gameplay.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity auth and react-query cache clearing.",
  "frontend/src/components/PastelPanel.tsx": "Styled container panel with a pastel textured background and customizable classes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name input and save mutation.",
  "frontend/src/components/SessionSummaryModal.tsx": "Displays session results and records rewards while updating local progression.",
  "frontend/src/components/ThemeSettingsSheet.tsx": "Sheet UI allowing users to select or override time‑of‑day theme settings.",
  "frontend/src/game/assets.ts": "Defines asset paths, sprite frame layouts, and an image loader utility.",
  "frontend/src/game/GameCanvas.tsx": "Main game canvas handling asset loading, input, session updates, rendering, and session summary display.",
  "frontend/src/game/progression.ts": "Manages player progression including collections, quests, leveling, and localStorage persistence.",
  "frontend/src/game/sessionLogic.ts": "Defines session state and game loop logic for clouds collecting items, spawning objects, and computing rewards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, storage, and status.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query for user profiles, world state, and rewards, including mutations and cache invalidation.",
  "frontend/src/hooks/useTelegram.ts": "Detects Telegram WebApp availability and exposes share and haptic utilities.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom pastel theme variables with component and utility layers.",
  "frontend/src/lib/deepLinks.ts": "Parses and constructs hash-based deep links for navigating app views.",
  "frontend/src/lib/telegramWebApp.ts": "Provides helpers to access Telegram WebApp API with a mock fallback when unavailable.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity provider.",
  "frontend/src/pages/CosmeticsShopPage.tsx": "Renders the cosmetics shop UI, allowing users to browse categories, purchase items, and equip cosmetics with toast feedback.",
  "frontend/src/pages/HelpCommandsPage.tsx": "Displays an accordion list of bot commands with descriptions for navigating and using Qudo Skyworld.",
  "frontend/src/pages/RewardsPage.tsx": "Shows total Qudo earned and recent reward entries, with loading and login states handled via hooks.",
  "frontend/src/pages/SkyWorldPage.tsx": "Displays the user's Sky World stats and decorations, including loading and missing-world states.",
  "frontend/src/pages/SocialPage.tsx": "Provides friend-code sharing, friend world lookup, and visit functionality with identity checks and toast messaging.",
  "frontend/src/social/friendCodes.ts": "Implements simple friend-code generation, validation, share text, and share URL creation utilities.",
  "frontend/src/state/useCosmetics.ts": "Defines cosmetic item types, a cosmetics catalog, and a React hook managing currency, purchased items, and equipped cosmetics with localStorage persistence.",
  "frontend/src/theme/timeOfDay.ts": "Provides time-of-day themed visuals and a hook that updates themes based on real time or a stored override.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash query parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, animations, and theme settings for the project’s pastel aesthetic.",
  "project_state.json": "Project state metadata describing the game’s concept, requirements, architecture notes, assets, and existing feature definitions."
}